---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterFailures.ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater
source: html/41880839-d578-c52a-5082-09007a15f96b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterFailures.ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater Property

There is only one component in this repeater.

## Syntax (C#)
```csharp
public static FailureDefinitionId ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater { get; }
```